ht32-holtek/HT32_STD_1xxxx_FWLib/example/USBD/USB_UAC_Sound_RateControl/main.c
/*********************************************************************************************************//**
 * @file    USBD/USB_UAC_Sound_RateControl/main.c
 * @version $Rev:: 1006         $
 * @date    $Date:: 2017-12-21 #$
 * @brief   The main program of USB Device Audio example.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/
// <<< Use Configuration Wizard in Context Menu >>>

/* Includes ------------------------------------------------------------------------------------------------*/
#include <string.h>
#include "ht32.h"
#include "ht32_board.h"
#include "ht32_board_config.h"
#include "main.h"

#include "i2cm.h"
#include "wm8978.h"
#include "ht32_usbd_core.h"
#include "ht32_usbd_class.h"
#include "ht32_usbd_descriptor.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup USBD_Examples USBD
  * @{
  */

/** @addtogroup USB_UAC_Sound_RateControl
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
#define I2S_RCEN  0x00010000ul
#define I2S_RCSEL 0x00020000ul

/* Private function prototypes -----------------------------------------------------------------------------*/
void SYSTICK_Configuration(void);
void NVIC_Configuration(void);
void CKCU_Configuration(void);
void GPIO_Configuration(void);
void USB_Configuration(void);
void USBPLL_Configuration(void);
void I2S_Configuration(void);
void PDMA_Configuration(void);

void I2S_MainRoutine(void);
void Suspend(u32 uPara);
void DelayXuS(u32 uS);

/* Global variables ----------------------------------------------------------------------------------------*/
__ALIGN4 USBDCore_TypeDef gUSBCore;
USBD_Driver_TypeDef gUSBDriver;
u32 gIsLowPowerAllowed = TRUE;

__ALIGN4 u32 TxBuf[2][HALF_BUF_SIZE];
__ALIGN4 u32 I2SBuf[I2S_BUF_SIZE][HALF_BUF_SIZE];
u8 I2SBufWriteIndex = 0;
u8 I2SBufReadIndex = 0;
vu8 I2SBufLen = 0;
vu8 AltBuf = 1;

I2CM_TransferType I2CM_Transfer;

const u16 I2S_RateControlCounterTable[1] =
{
  2000, // 0.05%
  //1000, // 0.10%
  //665,  // 0.15%
};
int I2S_RateContronIndex = 0;
int I2S_CurrentRateContronIndex = 0;
u8 I2SPreLen = 0;
vu32 gI2S_RateProcessDownCnt;

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Main program.
  * @retval None
  ***********************************************************************************************************/
int main(void)
{
  RETARGET_Configuration();           /* Retarget Related configuration                                     */

  NVIC_Configuration();
  CKCU_Configuration();
  GPIO_Configuration();

  USB_Configuration();                /* USB Related configuration                                          */

  I2CM_Init();
  WM8978_Init();

  /* Config PDMA for I2S TX                                                                                 */
  PDMA_Configuration();

  /* Config I2S                                                                                             */
  I2S_Configuration();

  SYSTICK_Configuration();

  HT32F_DVB_USBConnect();

  while (1)
  {
    USBDCore_MainRoutine(&gUSBCore);  /* USB core main routine                                              */
    I2S_MainRoutine();
  }
}

/*********************************************************************************************************//**
 * @brief  I2S Main Routine.
 * @retval None
 ************************************************************************************************************/
void I2S_MainRoutine(void)
{
  if (UAC_bMuteControl == 0x00)
  {
    I2S_TxMuteCmd(DISABLE);
  }
  else
  {
    I2S_TxMuteCmd(ENABLE);
  }

  if (gI2S_RateProcessDownCnt == 0)
  {
    gI2S_RateProcessDownCnt = 5;

    if (I2SBufLen < I2S_BUF_MID)
    {
      if (I2SPreLen >= I2SBufLen)
      {
        I2S_RateContronIndex += 1;
        if (I2S_RateContronIndex > 1)
        {
          I2S_RateContronIndex = 1;
        }
      }
    }
    else if (I2SBufLen > I2S_BUF_MID)
    {
      if (I2SPreLen <= I2SBufLen)
      {
        I2S_RateContronIndex -= 1;
        if (I2S_RateContronIndex < -1)
        {
          I2S_RateContronIndex = -1;
        }
      }
    }
    else
    {
      I2S_RateContronIndex = 0;
    }

    if (I2S_CurrentRateContronIndex != I2S_RateContronIndex)
    {
      I2S_CurrentRateContronIndex = I2S_RateContronIndex;

      if (I2S_CurrentRateContronIndex > 0)
      {
        HT_I2S->CR |= I2S_RCSEL;
        HT_I2S->RCNTR = I2S_RateControlCounterTable[I2S_CurrentRateContronIndex - 1];
      }
      else if (I2S_CurrentRateContronIndex < 0)
      {
        int tmp = 0 - I2S_CurrentRateContronIndex;
        HT_I2S->CR &= ~I2S_RCSEL;
        HT_I2S->RCNTR = I2S_RateControlCounterTable[tmp - 1];
      }
      else
      {
        HT_I2S->RCNTR = 0;
      }
    }

