ht32-holtek/HT32_STD_1xxxx_FWLib/example/USBD/USB_UAC_Sound_RateControl/main.c
    #if 0
    {
      static int a;
      static u8 b, c, cc;
      cc =I2SBufLen;
      if ((a != I2S_CurrentRateContronIndex) || (b != I2SPreLen) || (c != cc))
        printf("\r\n%d %u %u", I2S_CurrentRateContronIndex, I2SPreLen, I2SBufLen);

      a = I2S_CurrentRateContronIndex;
      b = I2SPreLen;
      c = cc;
    }
    #endif

    I2SPreLen = I2SBufLen;
  }
}

/*********************************************************************************************************//**
  * @brief  Suspend call back function which enter DeepSleep1
  * @param  uPara: Parameter for Call back function
  * @retval None
  ***********************************************************************************************************/
void Suspend(u32 uPara)
{
  #if (REMOTE_WAKEUP == 1)
  u32 IsRemoteWakeupAllowed;
  #endif

  if (gIsLowPowerAllowed)
  {

    #if (REMOTE_WAKEUP == 1)
    /* Disable EXTI interrupt to prevent interrupt occurred after wakeup                                    */
    EXTI_IntConfig(KEY1_BUTTON_EXTI_CHANNEL, DISABLE);
    IsRemoteWakeupAllowed = USBDCore_GetRemoteWakeUpFeature(&gUSBCore);

    if (IsRemoteWakeupAllowed == TRUE)
    {
      /* Enable EXTI wake event and clear wakeup flag                                                       */
      EXTI_WakeupEventConfig(KEY1_BUTTON_EXTI_CHANNEL, EXTI_WAKEUP_LOW_LEVEL, ENABLE);
      EXTI_ClearWakeupFlag(KEY1_BUTTON_EXTI_CHANNEL);
    }
    #endif

    __DBG_USBPrintf("%06ld >DEEPSLEEP\r\n", ++__DBG_USBCount);

    // Add your procedure here which disable related IO to reduce power consumption
    // ..................
    //

    if ((gUSBCore.Info.CurrentStatus == USB_STATE_SUSPENDED) && ((HT_USB->CSR & 0xC0) == 0x40))   // D+ = 1, D- = 0
    {
      /* For Bus powered device, you must enter DeepSleep1 when device has been suspended. For self-powered */
      /* device, you may decide to enter DeepSleep1 or not depended on your application.                    */

      /* For the convenient during debugging and evaluation stage, the USBDCore_LowPower() is map to a null */
      /* function by default. In the real product, you must map this function to the low power function of  */
      /* firmware library by setting USBDCORE_ENABLE_LOW_POWER as 1 (in the ht32fxxxx_usbdconf.h file).     */
      USBDCore_LowPower();
    }

    // Add your procedure here which recovery related IO for application
    // ..................
    //

    __DBG_USBPrintf("%06ld <DEEPSLEEP\r\n", ++__DBG_USBCount);

    #if (REMOTE_WAKEUP == 1)
    if (EXTI_GetWakeupFlagStatus(KEY1_BUTTON_EXTI_CHANNEL) == SET)
    {
      __DBG_USBPrintf("%06ld WAKEUP\r\n", ++__DBG_USBCount);
      if (IsRemoteWakeupAllowed == TRUE && USBDCore_IsSuspend(&gUSBCore) == TRUE)
      {
        USBDCore_TriggerRemoteWakeup();
      }
    }

    if (IsRemoteWakeupAllowed == TRUE)
    {
      /* Disable EXTI wake event and clear wakeup flag                                                      */
      EXTI_WakeupEventConfig(KEY1_BUTTON_EXTI_CHANNEL, EXTI_WAKEUP_LOW_LEVEL, DISABLE);
      EXTI_ClearWakeupFlag(KEY1_BUTTON_EXTI_CHANNEL);
    }

    /* Clear EXTI edge flag and enable EXTI interrupt                                                       */
    EXTI_ClearEdgeFlag(KEY1_BUTTON_EXTI_CHANNEL);
    EXTI_IntConfig(KEY1_BUTTON_EXTI_CHANNEL, ENABLE);
    #endif
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Get I2S Buffer Full state
  * @retval TRUE or FALSE
  ***********************************************************************************************************/
bool I2S_IsBufferFull(void)
{
  if (I2SBufLen >= I2S_BUF_SIZE)
    return TRUE;
  else
    return FALSE;
}

/*********************************************************************************************************//**
 * @brief  Get I2S Buffer Empty State
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool I2S_IsBufferEmpty(void)
{
  if (I2SBufLen == 0)
    return TRUE;
  else
    return FALSE;
}

/*********************************************************************************************************//**
 * @brief  Write Data into I2S software buffer
 * @retval 0 or I2S_BUF_SIZE
 ************************************************************************************************************/
u32 I2S_BufferWrite(u32* pFrom)
{
  if (I2SBufLen > I2S_BUF_SIZE)
  {
    return 0;
  }
  else
  {
    u32* pTo = (u32*)&I2SBuf[I2SBufWriteIndex][0];
    int i = HALF_BUF_SIZE;

    __set_PRIMASK(1);

    while (i--)
    {
      *pTo = *pFrom;
      pTo++;
      pFrom++;
    }
    I2SBufWriteIndex++;
    if (I2SBufWriteIndex == I2S_BUF_SIZE)
    {
      I2SBufWriteIndex = 0;
    }
    I2SBufLen++;

    __set_PRIMASK(0);

    return I2S_BUF_SIZE;
  }
}

/*********************************************************************************************************//**
 * @brief  Read I2C Software buffer
 * @retval Always 0
 ************************************************************************************************************/
u32 I2S_BufferRead(u32* pTo)
{
  if (I2SBufLen == 0)
  {
    int i = HALF_BUF_SIZE;

    while (i--)
    {
      *pTo = 0x00000000;
      pTo++;
    }

    return 0;
  }
  else
  {
    u32* pFrom = (u32*)&I2SBuf[I2SBufReadIndex][0];
    int i = HALF_BUF_SIZE;

    __set_PRIMASK(1);

    while (i--)
    {
      *pTo = *pFrom;
      pTo++;
      pFrom++;
    }
    I2SBufReadIndex++;
    if (I2SBufReadIndex == I2S_BUF_SIZE)
    {
      I2SBufReadIndex = 0;
    }
    I2SBufLen--;

    __set_PRIMASK(0);

    return I2S_BUF_SIZE;
  }
}

/*********************************************************************************************************//**
  * @brief  Configure the system clocks.
  * @retval None
  ***********************************************************************************************************/
void CKCU_Configuration(void)
{
#if 1
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  CKCUClock.Bit.PDMA          = 1;
  CKCUClock.Bit.USBD          = 1;
  CKCUClock.Bit.AFIO          = 1;
  CKCUClock.Bit.EXTI          = 1;
  CKCUClock.Bit.I2S           = 1;
  HTCFG_I2CM_CKCU(CKCUClock)  = 1;
  CKCU_PeripClockConfig(CKCUClock, ENABLE);
#endif

  /*--------------------------------------------------------------------------------------------------------*/
  /* Set USB Clock as PLL / HTCFG_USBPRE_DIV                                                                */
  /*--------------------------------------------------------------------------------------------------------*/
  CKCU_SetUSBPrescaler(HTCFG_USBPRE_DIV);

