ht32-holtek/HT32_STD_1xxxx_FWLib/example/USBD/USB_UAC_Sound_RateControl/main.c
}

/*********************************************************************************************************//**
  * @brief  Configure USART.
  * @retval None
  ***********************************************************************************************************/
void GPIO_Configuration(void)
{
  /* I2S                                                                                                    */
  AFIO_GPxConfig(HTCFG_I2S_BCLK_ID, HTCFG_I2S_BCLK_ADIO_PIN, AFIO_FUN_I2S);
  AFIO_GPxConfig(HTCFG_I2S_SDO_ID,  HTCFG_I2S_SDO_ADIO_PIN,  AFIO_FUN_I2S);
  AFIO_GPxConfig(HTCFG_I2S_SDI_ID,  HTCFG_I2S_SDI_ADIO_PIN,  AFIO_FUN_I2S);
  AFIO_GPxConfig(HTCFG_I2S_MCLK_ID, HTCFG_I2S_MCLK_ADIO_PIN, AFIO_FUN_I2S);
  AFIO_GPxConfig(HTCFG_I2S_WS_ID,   HTCFG_I2S_WS_ADIO_PIN,   AFIO_FUN_I2S);

  /* I2C                                                                                                    */
  AFIO_GPxConfig(HTCFG_I2CM_MASTER_SCK_ID, HTCFG_I2CM_MASTER_SCK_AFIO_PIN, AFIO_FUN_I2C);
  AFIO_GPxConfig(HTCFG_I2CM_MASTER_SDA_ID, HTCFG_I2CM_MASTER_SDA_AFIO_PIN, AFIO_FUN_I2C);
}

/*********************************************************************************************************//**
  * @brief  SYSTICK_Configuration.
  * @retval None
  ***********************************************************************************************************/
void SYSTICK_Configuration(void)
{
  /* SYSTICK configuration                                                                                  */
  SYSTICK_ClockSourceConfig(SYSTICK_SRC_FCLK);
  SYSTICK_SetReloadValue((HTCFG_SYSTICK_1US_MUL * 1000) - 1);
  SYSTICK_IntConfig(DISABLE);

  /* Enable the SysTick Counter                                                                             */
  SYSTICK_CounterCmd(SYSTICK_COUNTER_ENABLE);

  /* Enable Timebase Interrupt                                                                              */
  SYSTICK_IntConfig(ENABLE);
}

/*********************************************************************************************************//**
  * @brief  Configure the NVIC vector table.
  * @retval None
  ***********************************************************************************************************/
void NVIC_Configuration(void)
{
  NVIC_SetVectorTable(NVIC_VECTTABLE_FLASH, 0x0);     /* Set the Vector Table base location at 0x00000000   */

  NVIC_SetPriority(PDMACH3_IRQn, 0);
  NVIC_SetPriority(HTCFG_I2CM_IRQ, 2);
  NVIC_SetPriority(USB_IRQn, 2);
  NVIC_SetPriority(I2S_IRQn, 3);

  NVIC_EnableIRQ(I2S_IRQn);
  NVIC_EnableIRQ(PDMACH3_IRQn);
  NVIC_EnableIRQ(HTCFG_I2CM_IRQ);
}

/*********************************************************************************************************//**
  * @brief  Configure USB.
  * @retval None
  ***********************************************************************************************************/
void USB_Configuration(void)
{
  #if (LIBCFG_CKCU_USB_PLL)
  USBPLL_Configuration();
  #endif

  gUSBCore.pDriver = (u32 *)&gUSBDriver;                /* Initiate memory pointer of USB driver            */
  gUSBCore.Power.CallBack_Suspend.func  = Suspend;      /* Install suspend call back function into USB core */
  //gUSBCore.Power.CallBack_Suspend.uPara = (u32)NULL;

  USBDDesc_Init(&gUSBCore.Device.Desc);                 /* Initiate memory pointer of descriptor            */
  USBDClass_Init(&gUSBCore.Class);                      /* Initiate USB Class layer                         */
  USBDCore_Init(&gUSBCore);                             /* Initiate USB Core layer                          */

#if (LIBCFG_CKCU_HSI_NO_AUTOTRIM)
#else
  /* !!! NOTICE !!!
     Must turn on if the USB clock source is from HSI (PLL clock Source)
  */
  #if 0
  { /* Turn on HSI auto trim function                                                                       */
    CKCU_HSIAutoTrimClkConfig(CKCU_ATC_USB);
    CKCU_HSIAutoTrimCmd(ENABLE);
  }
  #endif
#endif

  NVIC_EnableIRQ(USB_IRQn);                             /* Enable USB device interrupt                      */
}

#if (LIBCFG_CKCU_USB_PLL)
/*********************************************************************************************************//**
 * @brief  Configure USB PLL
 * @retval None
 ************************************************************************************************************/
void USBPLL_Configuration(void)
{
  { /* USB PLL configuration                                                                                */

    /* !!! NOTICE !!!
       Notice that the local variable (structure) did not have an initial value.
       Please confirm that there are no missing members in the parameter settings below in this function.
    */
    CKCU_PLLInitTypeDef PLLInit;

    PLLInit.ClockSource = CKCU_PLLSRC_HSE;  // CKCU_PLLSRC_HSE or CKCU_PLLSRC_HSI
    PLLInit.CFG = CKCU_USBPLL_8M_48M;
    PLLInit.BYPASSCmd = DISABLE;
    CKCU_USBPLLInit(&PLLInit);
  }

  CKCU_USBPLLCmd(ENABLE);

  while (CKCU_GetClockReadyStatus(CKCU_FLAG_USBPLLRDY) == RESET);
  CKCU_USBClockConfig(CKCU_CKUSBPLL);
}
#endif

/*********************************************************************************************************//**
  * @brief  Configure the I2S.
  * @retval None
  ***********************************************************************************************************/
void I2S_Configuration(void)
{
  /* !!! NOTICE !!!
     Notice that the local variable (structure) did not have an initial value.
     Please confirm that there are no missing members in the parameter settings below in this function.
  */
  I2S_InitTypeDef I2S_InitStructure;
  I2S_InitStructure.I2S_Mode = I2S_MASTER_TX_RX;
  I2S_InitStructure.I2S_Format = I2S_JUSTIFIED_STEREO;
  I2S_InitStructure.I2S_WordWidth = I2S_WORDWIDTH_16;
  I2S_InitStructure.I2S_MclkOut = ENABLE;
  I2S_InitStructure.I2S_MclkInv = DISABLE;
  I2S_InitStructure.I2S_BclkInv = DISABLE;
  I2S_InitStructure.I2S_X_Div = HTCFG_I2S_X_DIV;                // MCLK = (PCLK * X_DIV / Y_DIV) / 2 = about 12.288 MHz (256 x 48 kHz, WM8978 required the MCLK = 256 fs)
  I2S_InitStructure.I2S_Y_Div = HTCFG_I2S_Y_DIV;
  I2S_InitStructure.I2S_N_Div = 256 / (2 * 16) - 1;             // BCLK = MCLK / 8 = about 1536 kHz (32 x 48 kHz, 2 CH x 16-bit = 32 fs)
  I2S_Init(&I2S_InitStructure);

  I2S_FIFOTrigLevelConfig(I2S_TX_FIFO, 4);  // Tx FIFO data '<' or '=' 3
  I2S_PDMACmd(I2S_PDMAREQ_TX, ENABLE);

